{
    "job_description": "SENIOR BACKEND ENGINEER - FINTECH STARTUP\n\nCOMPANY OVERVIEW\nJoin our rapidly growing fintech startup that's revolutionizing digital payments and financial services. We're building the next generation of financial infrastructure that will serve millions of users worldwide. Our engineering team values innovation, collaboration, and technical excellence.\n\nROLE SUMMARY\nWe're seeking an experienced Senior Backend Engineer to join our core engineering team. You'll be responsible for designing and implementing scalable backend services, working closely with our product and frontend teams to deliver world-class financial products. This is a high-impact role where you'll have significant influence on our technical architecture and engineering culture.\n\nRESPONSIBILITIES\n• Design and develop high-performance, scalable backend services and APIs\n• Build secure, reliable financial systems handling millions of transactions\n• Collaborate with product managers and frontend engineers to deliver features\n• Participate in architectural decisions and technical design reviews\n• Mentor junior engineers and contribute to engineering best practices\n• Ensure system reliability, monitoring, and performance optimization\n• Work in an agile environment with continuous integration and deployment\n\nREQUIRED QUALIFICATIONS\n• 5+ years of professional software development experience\n• Strong expertise in Python programming and web frameworks (Django or FastAPI required)\n• Extensive experience with PostgreSQL database design and optimization\n• Hands-on experience with AWS cloud services (EC2, S3, RDS, Lambda)\n• Proficiency in building RESTful APIs and microservices architecture\n• Experience with containerization technologies (Docker required)\n• Strong understanding of software engineering best practices and design patterns\n• Experience with version control systems (Git) and collaborative development workflows\n• Knowledge of agile development methodologies and CI/CD practices\n• Bachelor's degree in Computer Science, Engineering, or equivalent experience\n\nPREFERRED QUALIFICATIONS\n• Experience in fintech, payments, or financial services industry\n• Knowledge of Kubernetes orchestration and cloud-native architectures\n• Experience with Redis caching and message queuing systems\n• Familiarity with monitoring and observability tools (Prometheus, Grafana, ELK stack)\n• Experience with Infrastructure as Code (Terraform, CloudFormation)\n• Knowledge of security best practices and compliance requirements (PCI DSS, SOX)\n• Experience with event-driven architectures and distributed systems\n• Contributions to open-source projects\n• Experience mentoring and leading technical teams\n\nTECH STACK\n• Backend: Python, Django, FastAPI\n• Database: PostgreSQL, Redis\n• Cloud: AWS (EC2, S3, RDS, Lambda, CloudWatch)\n• Infrastructure: Docker, Kubernetes, Terraform\n• Monitoring: Prometheus, Grafana, CloudWatch\n• CI/CD: Jenkins, GitHub Actions\n• Other: Elasticsearch, Apache Kafka, gRPC\n\nWHAT WE OFFER\n• Competitive salary and equity package ($150,000 - $200,000 base)\n• Comprehensive health, dental, and vision insurance\n• Flexible work arrangements and remote-friendly culture\n• Professional development budget and conference attendance\n• Latest MacBook Pro and equipment stipend\n• Unlimited PTO and flexible working hours\n• Stock options with high growth potential\n• Opportunity to shape the future of fintech\n\nLOCATION\nSan Francisco, CA (Hybrid - 3 days in office, 2 days remote)\nWe also consider exceptional remote candidates\n\nAPPLICATION PROCESS\n1. Technical phone screen (45 minutes)\n2. Take-home coding challenge (2-3 hours)\n3. Virtual technical interviews (2 rounds, 1 hour each)\n4. Final round with engineering leadership and culture fit\n\nTO APPLY\nPlease submit your resume along with:\n• GitHub profile or portfolio showcasing your best work\n• Brief cover letter explaining your interest in fintech\n• Any relevant side projects or open-source contributions\n\nWe are an equal opportunity employer committed to diversity and inclusion. We welcome applications from candidates of all backgrounds and experiences.",
    "title": "Senior Backend Engineer",
    "company": "FinTech Innovations Inc."
  }